# Задача-2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)

# date = input("Введите дату в формате dd.mm.yyyy:")
# month = ["", "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"]
# print(date, "срез:", date[3:5])
# print(month[int(date[3:5])], date[6:10], "года")

# date = input("Введите дату в формате dd.mm.yyyy:")  # можно добавить проверку через regexp
date = "20.03.2009"
month = ["", "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября",]

days = [["", "первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое"],
        ["десятое", "одинадцатое", "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое", "девятнадцатое"],
        ["двадцатое", "двадцатое", "двадцать", "тридцатое", "тридцать"]]

# print("days =")
# for line in days:
#     print(line)

print("Дата: ", date[0], date[1])
# проверяем на кратность 10

if int(date[0]) == 0:
    print(date.replace(date, days[int(date[0])][int(date[1])]), month[int(date[3:5])], date[6:10], "года")
elif int(date[0]) == 1:
        print(date.replace(date, days[int(date[0])][int(date[1])]), month[int(date[3:5])], date[6:10], "года")
elif int(date[0]) == 2:
    print("двадцать", date.replace(date, days[int(date[0])][int(date[1])]), month[int(date[3:5])], date[6:10], "года")
else:
    print(date.replace(date, days[int(date[0]) - 1][int(date[1]) + 3]), "первое", month[int(date[3:5])], date[6:10], "года")
